@extends('app')

@section('contents')
    <div class="main">
        <input type="hidden" name="_token" value="{{ csrf_token() }}">
        <div class="container logintop">
                <div class="row justify-content-center">
                    <div class="col-md-8">
                        <div class="card">
                            <div class="head-title2 card-header card-header-color ">飲料訂單</div>
                            <div class="card-body card-body-color">
        {!! Form::open(['url' => 'items']) !!}
        <div class="form-group">
            {!! Form::label('type', '飲料名稱：') !!}
            {!! Form::text('type', null) !!}
            <br>
            {!! Form::label('explanation', '甜度：'),Form::select('size', array( '3' => '微糖', '5' => '半糖','7' => '少糖','9' => '不要太甜', '10' => '正常'), '10') !!}
            <br>
            {!! Form::label('explanation', '冰塊：'),Form::select('size', array( '3' => '微冰', '7' => '少冰','10' => '正常','SH' => '溫', 'H' => '熱'), '10')  !!}
            <br>
            {!! Form::label('type', '自取：'), Form::radio('name', 'value', true), Form::label('type', '外送：'),Form::radio('name', 'value', true); !!}
            <br>
            {!! Form::label('type', '外送地點：'),   Form::text('suon', '滿兩百才有外送'); !!}
            <br>
            {!! Form::label('explanation', '自取外送時間：'),Form::select('m', array('12'=>'12','11'=>'11','10'=>'10','9'=>'9','8'=>'8','7'=>'7','6'=>'6','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1'), '6') ,
                Form::label('explanation', '月 '),Form::select('d', array('31'=>'31','30'=>'30','29'=>'29','28'=>'28','27'=>'27','26'=>'26','25'=>'25','24'=>'24','23'=>'23','22'=>'22','21'=>'21','20'=>'20','19'=>'19','18'=>'18','17'=>'17','16'=>'16','15'=>'15','14'=>'14','13'=>'13','12'=>'12','11'=>'11','10'=>'10','9'=>'9','8'=>'8','7'=>'7','6'=>'6','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1'), '6') ,
                Form::label('explanation', '日 '),Form::select('d', array('24'=>'24','23'=>'23','22'=>'22','21'=>'21','20'=>'20','19'=>'19','18'=>'18','17'=>'17','16'=>'16','15'=>'15','14'=>'14','13'=>'13','12'=>'12','11'=>'11','10'=>'10','9'=>'9','8'=>'8','7'=>'7','6'=>'6','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1'), '6'),
                Form::label('explanation', '點'), Form::select('d', array('60'=>'60','59'=>'59','58'=>'58','57'=>'57','56'=>'56','55'=>'55','54'=>'54','53'=>'53','52'=>'52','51'=>'51','50'=>'50','49'=>'29','48'=>'48','47'=>'47','46'=>'46','45'=>'45','44'=>'44','43'=>'43','42'=>'42','41'=>'41','40'=>'40','39'=>'39','38'=>'38','37'=>'37','36'=>'36','35'=>'35','34'=>'34','33'=>'33','32'=>'32','30'=>'30','29'=>'29','28'=>'28','27'=>'27','26'=>'26','25'=>'25','24'=>'24','23'=>'23','22'=>'22','21'=>'21','20'=>'20','19'=>'19','18'=>'18','17'=>'17','16'=>'16','15'=>'15','14'=>'14','13'=>'13','12'=>'12','11'=>'11','10'=>'10','9'=>'9','8'=>'8','7'=>'7','6'=>'6','5'=>'5','4'=>'4','3'=>'3','2'=>'2','1'=>'1'), '6')
                  ,Form::label('explanation', '分')!!}
            <br>
            {!! Form::label('type', '備註：') !!}
            {!! Form::text('type', null) !!}
            <br>
            {!! Form::submit('新增')!!}
            {!! Form::reset('重新輸入') !!}
        </div>
        {!! Form::close() !!}
                            </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
@endsection
